cf_billing/InformationRegisters/энргПросуженнаяПени.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>энргПросуженнаяПени</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Просуженная</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаРанееНачисленнойПени</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>МКД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргСтроения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Абонент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргАбоненты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргВидыУслуг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПериодРасчета</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/InformationRegisters/энргПросуженнаяПени/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

#Область РеализацияИнтерфейса_ПолучениеДанных

// Заполняет просуженную пени за период.
//
// Параметры:
//  Схема				-	СхемаЗапроса.
//  ПараметрыОтбора		-	Структура.
//  ТаблицаДляПомещения	-	Строка.
//
Процедура ПросуженнаяПениЗаПериод(Схема, ПараметрыСхемы, ТаблицаДляПомещения = "") Экспорт 
	
	Если Схема = Неопределено Тогда
		Схема  	= Новый СхемаЗапроса;
		Пакет 	= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 	= Схема.ПакетЗапросов.Добавить();
	КонецЕсли;
	
	Пакет.УстановитьТекстЗапроса(ТекстЗапросаПросуженнаяЗадолженностьЗаПериод());
	Пакет.ТаблицаДляПомещения = ТаблицаДляПомещения;
	
	Операторы = Пакет.Операторы;
	ПараметрыИсточника = Операторы[0].Источники[0].Источник.Параметры;
	
	Если ПараметрыСхемы.Свойство("Период") Тогда
		ПараметрПериод 				= ПараметрыИсточника[0];
		ПараметрПериод.Выражение 	= Новый ВыражениеСхемыЗапроса(СтрШаблон("&%1", ПараметрыСхемы["Период"].ИмяПараметра));
	КонецЕсли;
			
	Если ПараметрыСхемы.Свойство("ПараметрыВТ") Тогда
		ДоступныеПоляОтбора = "Организация,Район,МКД,Абонент,Услуга,ПериодНачисления,ПериодРасчета";
		ПараметрИсточника 	= ПараметрыИсточника[1];
		энргФормированиеТекстовЗапроса.УстановитьПараметрыВременнойТаблицыРегистраСведений(ПараметрИсточника, ПараметрыСхемы.ПараметрыВТ, ДоступныеПоляОтбора);
		
		энргФормированиеТекстовЗапроса.УстановитьОтборТаблицы(Операторы[0].Отбор, "энргПросуженнаяПениСрезПоследних", ПараметрыСхемы.ПараметрыВТ, "Просуженная");
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти 

#Область СлужебныеПроцедурыИФункции

#Область ТекстыЗапросовПолученияДанных

Функция ТекстЗапросаПросуженнаяЗадолженностьЗаПериод()
	Текст  = 
	"ВЫБРАТЬ
	|	энргПросуженнаяПениСрезПоследних.Организация КАК Организация,
	|	энргПросуженнаяПениСрезПоследних.Район КАК Район,
	|	энргПросуженнаяПениСрезПоследних.МКД КАК МКД,
	|	энргПросуженнаяПениСрезПоследних.Абонент КАК Абонент,
	|	энргПросуженнаяПениСрезПоследних.Услуга КАК Услуга,
	|	энргПросуженнаяПениСрезПоследних.ПериодНачисления КАК ПериодНачисления,
	|	энргПросуженнаяПениСрезПоследних.ПериодРасчета КАК ПериодРасчета,
	|	энргПросуженнаяПениСрезПоследних.Просуженная КАК Просуженная,
	|	энргПросуженнаяПениСрезПоследних.Сумма КАК Сумма
	|ИЗ
	|	РегистрСведений.энргПросуженнаяПени.СрезПоследних(, ) КАК энргПросуженнаяПениСрезПоследних";
	
	Возврат Текст;
	
КонецФункции

#КонецОбласти
	
#КонецОбласти

#КонецЕсли
